app/Controllers/Administrador.php

    public function index()
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
            return redirect()->to(base_url('/usuario'));
        }

        $administradorA = model('AdministradorA');

        $data['administrador'] = $administradorA->findAll();
---
SELECT *
FROM `administrador`