app/Controllers/Imagen.php

SELECT *
FROM `imagen`
WHERE `imagen`.`idImagen` = '48'
---
    public function getFile($idImagen)
    {
        // Buscar el archivo por su ID en la base de datos
        $fileRecord = $this->ImagenM->find($idImagen);