app/Controllers/Local.php

    public function Sucursal()
    {
        $localP = model('LocalP');

        $data['local'] = $localP->findAll();
---
SELECT *
FROM `local`