app/Controllers/Personal.php

    public function index()
    {
        $session = session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
            return redirect()->to(base_url('/usuario'));
        }

        $personalP = model('PersonalP');

        $data['personal'] = $personalP->findAll();
---
SELECT *
FROM `personal`